system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     interIsoFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         20;

deltaT          0.01;

writeControl    timeStep;

writeInterval   20;

purgeWrite      1;

maxCo           10;
maxAlphaCo           5;

writeFormat     binary;

writePrecision  12;

writeCompression no;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;


functions
{
#include forces;
#include yPlus;
#include wettedSurface;
}



// ************************************************************************* //
