system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
#include "shipDict"
vertices
(
   
   //notes:  coarse mesh was (-700 -700 -500) for the lower hex 

    ($shipParameters.xMin $shipParameters.yMin $shipParameters.zMin)  
    ($shipParameters.xMax $shipParameters.yMin  $shipParameters.zMin)
    ($shipParameters.xMax $shipParameters.yMax $shipParameters.zMin)
    ($shipParameters.xMin $shipParameters.yMax $shipParameters.zMin)

    ($shipParameters.xMin $shipParameters.yMin  0)  
    ($shipParameters.xMax $shipParameters.yMin  0)
    ($shipParameters.xMax $shipParameters.yMax 0)
    ($shipParameters.xMin $shipParameters.yMax 0)

    ($shipParameters.xMin $shipParameters.yMin  $shipParameters.zMax)  
    ($shipParameters.xMax $shipParameters.yMin  $shipParameters.zMax)
    ($shipParameters.xMax $shipParameters.yMax  $shipParameters.zMax)
    ($shipParameters.xMin $shipParameters.yMax $shipParameters.zMax)

/*
    (-18 -12 -18)  
    (16 -12 -18)
    (16 12 -18)
    (-18 12 -18)

    (-18 -12 0)  
    (16 -12 0)
    (16 12 0)
    (-18 12 0)

    (-18 -12 10)  
    (16 -12 10)
    (16 12 10)
    (-18 12 10)

*/
);

blocks
(
     //Coarse - cube lenght is 1m
     hex (0 1 2 3 4 5 6 7) ($shipParameters.xBlock  $shipParameters.yBlock $shipParameters.zBlockLower)  simpleGrading (1 1 1)
     hex (4 5 6 7 8 9 10 11)($shipParameters.xBlock  $shipParameters.yBlock $shipParameters.zBlockUpper) simpleGrading (1 1 1)
    
    //Fine - cube length is 0.5m
   // hex (0 1 2 3 4 5 6 7) (68 48 36) simpleGrading (1 1 1)
  //  hex (4 5 6 7 8 9 10 11) (68 48 20) simpleGrading (1 1 1)
    
  


);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 9 10)
            
            

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            
            
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    port
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            

        );
    }
    star
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
