system/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-999 -25 -0.168) (999 0.1 0.83);
    }
    {
        name    c0;
        type    cellSet;
        action  subtract;
        source  fieldToCell;
        sourceInfo
         {
            field cellLevel;
            min 2;
            max 8;
         }
     
    }
    {
        name    zone0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
         {
            set c0;
         }
         
    }
);

// ************************************************************************* //
