system/wettedSurface
    wettedSurface
    {
        type            wettedSurfaceArea;
        libs           ("libwettedSurfaceArea.so");
        
        alphaName      "alpha.water";
        patchName      "hull";
        
        writeControl   timeStep;
        writeInterval  1;
    }